# CannotFinalizeClusterInconsistency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotFinalizeClusterInconsistency Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't finalize because dependent element failed to finalize.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotFinalizeClusterInconsistency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotFinalizeClusterInconsistency As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotFinalizeClusterInconsistency {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace